
Feature: Добавя се нов запис за читател/потребител
  

  Scenario: Успешно добавен нов читател
    Given Отворена е формата за добавяне на нов читател
    And Библиотекарят се е логнал успешно
    When Въведено е име на нов читател
    And Въведена е парола
    And Натиснат е бутон Създай читател
    Then Извежда се съобщение "Успешно създадохте читател. "
    And Генерира се ID за новия запис
    And Създава се нов празен масив с активни заемания за новия читател

  
  Scenario: Опит за създаване на читател без парола
    Given Отворена е формата за добавяне на нов читател
    And Библиотекарят се е логнал успешно
    When Въведено е име на нов читател
    And Натиснат е бутон Създай читател
    Then Извежда се съобщение "Моля, въведете парола за новия читател."
    And Изчиства се формата за създаване на читател


