
Feature: Създава се нов запис за отдаване под наем


  Scenario: Опит за създаване на запис без въведен читател
    Given Библиотекарят се е логнал в системата
    And Отворена е формата за създаване на запис за отдаване
    When Въведена е книгата, която се отдава
    And Въведена е начална дата
    And Въведена е дата за очаквано връщане
    And Натиснат бутон Създай отдаване
    Then Извежда се съобщение "Моля, въвдете читател, който взима книгата. "
    And Формата за отдаване се изчиства

  Scenario: Опит за създаване на запис с отминала дата за връщане
    Given Библиотекарят се е логнал в системата
    And Отворена е формата за създаване на запис за отдаване
    When Въведена е книгата, която се отдава
    And Въведена е читател, който взима книгата
    And Въведена е начална дата
    And Въведена е дата за очаквано връщане, която е вече отминала, или по-малка от началната дата
    And Натиснат бутон Създай отдаване
    Then Извежда се съобщение "Моля, въвдете валидна дата за очаквано връщане."
    And Формата за отдаване се изчиства
  
  Scenario: Успешно създадено отдаване
    Given Библиотекарят се е логнал в системата
    And Отворена е формата за създаване на запис за отдаване
    When Въведена е книгата, която се отдава
    And Въведена е читател, който взима книгата
    And Въведена е начална дата
    And Въведена е дата за очаквано връщане
    And Натиснат бутон Създай отдаване
    Then Извежда се съобщение "Книгата е успешно отдадена под наем. "