
Feature: Login feature
  A librarian logs in with credentials 

  Scenario: Библиотекар се логва в системата с валидни данни
    Given Библиотекарят отваря началната страница
    And Въвежда име и парола
    When Името е валидно
    And Паролата е валидна
    And Натистан е бутонът за вход
    Then Съобщение " Добре дошли в библиотеката! "
    And визуализира се dashboard

  Scenario: Опит за логин без парола
    Given Библиотекарят отваря началната страница
    And Въвежда само име
    When Въвежда валидна парола
    And Натистан е бутонът за вход
    Then Съобщение "Моля, попърнете всички полета."
    And Формата за логин отново се изчиства от въведените данни


